/** 画质常数 */
export enum QUALITY {
    /** 自动 */
    AUTO = 0,
    /** 流畅 144P */
    P_144 = 5,
    /** 流畅 240P */
    P_240 = 6,
    /** 流畅 360P */
    P_360 = 16,
    /** 清晰 480P */
    P_480 = 32,
    /** 高清 720P */
    P_720 = 64,
    /** 高清 720P60 */
    P_720_60 = 74,
    /** 高清 1080P */
    P_1080 = 80,
    /** 高清 1080P+ */
    P_1080_PLUS = 112,
    /** 高清 1080P60 */
    P_1080_60 = 116,
    /** 超清 4K */
    P_4K = 120,
    /** HDR */
    P_HDR = 125,
    /** 杜比视界 */
    P_DOLBY = 126,
    /** 超高清 8K */
    P_8K = 127,
}

/** 画质描述 */
export enum QUALITY_DESCRIBE {
    '自动' = 0,
    '流畅 144P' = 5,
    '流畅 240P' = 6,
    '流畅 360P' = 16,
    '清晰 480P' = 32,
    '高清 720P' = 64,
    '高清 720P60' = 74,
    '高清 1080P' = 80,
    '高清 1080P+' = 112,
    '高清 1080P60' = 116,
    '超清 4K' = 120,
    'HDR' = 125,
    '杜比视界' = 126,
    '超高清 8K' = 127,
}